Core/src/src/Enums/ВидыОперацийРасходСоСчета/ВидыОперацийРасходСоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходСоСчета</name>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКредитаКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежныеКарты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличных</name>
  </enumValues>
  <enumValues>
    <name>ПереводНаДругойСчет</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВРазрезеСотрудников</name>
    <comment>// Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>AzRyПоставщикуПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ПенсионномуФонду</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийПоступлениеНаСчет/ВидыОперацийПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеНаСчет</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоКартам</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличными</name>
  </enumValues>
  <enumValues>
    <name>ПереводСДругогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ОтКурьерскойКомпанииПочты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенегОтСотрудника</name>
  </enumValues>
  <enumValues>
    <name>AzRyОтПоставщикаОтПодотчетника</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийПоступлениеВКассу/ВидыОперацийПоступлениеВКассу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеВКассу</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>РозничнаяВыручка</name>
  </enumValues>
  <enumValues>
    <name>РозничнаяВыручкаСуммовойУчет</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеНаличныхВБанке</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийРасходИзКассы/ВидыОперацийРасходИзКассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходИзКассы</name>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличнымиВБанк</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийПеремещенияДС/ВидыОперацийПеремещенияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПеремещенияДС</name>
  <comment>ONESOFT-3315</comment>
  <enumValues>
    <name>КассаБанк</name>
  </enumValues>
  <enumValues>
    <name>БанкКасса</name>
  </enumValues>
  <enumValues>
    <name>БанкБанк</name>
  </enumValues>
  <enumValues>
    <name>КассаКасса</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/CommonModules/ДвиженияДенежныхСредствВызовСервера/Module.bsl
Функция ПолучитьНовоеЗначениеСтатьиДДССписания(ВидОперацииПрочееСписание, СтатьяДДС, СтатьяДДСВходящий, СтатьяДДСИсходящий) Экспорт
	
	НоваяСтатьяДДС = СтатьяДДС;
	
	Если (СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
		ИЛИ СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		ИЛИ СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		ИЛИ НЕ ЗначениеЗаполнено(СтатьяДДС)) Тогда
		
		Если ВидОперацииПрочееСписание = Перечисления.ВидыОперацийРасходСоСчета.Покупателю Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
		ИначеЕсли ВидОперацииПрочееСписание = Перечисления.ВидыОперацийРасходСоСчета.Поставщику Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам);
		Иначе
			Возврат Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НоваяСтатьяДДС;
	
КонецФункции

Функция ПолучитьНовоеЗначениеСтатьиДДСПоступления(ВидОперацииПрочееПоступление, СтатьяДДС, СтатьяДДСВходящий, СтатьяДДСИсходящий) Экспорт
	
	НоваяСтатьяДДС = СтатьяДДС;
	
	Если (СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
		ИЛИ СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.Прочее
		ИЛИ СтатьяДДС = ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
		ИЛИ НЕ ЗначениеЗаполнено(СтатьяДДС)) Тогда
		
		Если ВидОперацииПрочееПоступление = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
		ИначеЕсли ВидОперацииПрочееПоступление = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей);
		ИначеЕсли ВидОперацииПрочееПоступление = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика Тогда
			Возврат ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам);
		Иначе
			Возврат Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НоваяСтатьяДДС;
	
КонецФункции

Функция ПолучитьОстатокНаСчете(БанковскийСчет, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(
		|			,
		|			Организация = &Организация И
		|				БанковскийСчетКасса = &БанковскийСчет) КАК ДенежныеСредстваОстатки";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаВалОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ЗаголовокНадписиОстатковДС(СчетКасса, Организация, ОстатокДенежныхСредств = 0) Экспорт
	
	КрупныйШрифт = Новый Шрифт(,11);
	МелкийШрифт  = Новый Шрифт(,8);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетКасса", СчетКасса);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваОстатки.Валюта КАК Валюта,
	|	ДенежныеСредстваОстатки.СуммаВалОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			,
	|			Организация = &Организация
	|				И БанковскийСчетКасса = &СчетКасса) КАК ДенежныеСредстваОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сумма = Выборка.Сумма;
		Валюта = Выборка.Валюта;
	Иначе
		Сумма = 0;
		Если ТипЗнч(СчетКасса) = Тип("СправочникСсылка.Кассы") Тогда
			Валюта = СчетКасса.ВалютаПоУмолчанию;
		Иначе
			Валюта = СчетКасса.ВалютаДенежныхСредств;
		КонецЕсли;
	КонецЕсли;
	
	ОстатокДенежныхСредств = Сумма;
	
	КомпонентыФС = Новый Массив;
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='ნაშთი';ru='Остаток';en='the balance'") + " ", КрупныйШрифт));
	
	СуммаСтрокой = Формат(Сумма, "ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0,00");
	ПозицияРазделителя = СтрНайти(СуммаСтрокой, ",");
	КомпонентыЧисла = Новый Массив;
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Лев(СуммаСтрокой, ПозицияРазделителя), КрупныйШрифт));
	КомпонентыЧисла.Добавить(Новый ФорматированнаяСтрока(Сред(СуммаСтрокой, ПозицияРазделителя+1), МелкийШрифт));
	КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(КомпонентыЧисла, , , , "Остаток"));
	
	КомпонентыФС.Добавить(" " + Валюта.СимвольноеПредставление);
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыФС, , ЦветаСтиля.ТекстВторостепеннойНадписи);
	
КонецФункции

#Область ПоступлениеДС

Функция ПолучитьСписокВидовОперацийПоступленияДСБанк() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее); // Прочее.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратДенегОтСотрудника); //+++ Дмгг ВозвратЗПОтСотрузника
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом); // Прочие расчеты.
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ПокупкаВалюты);
	КонецЕсли;
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты); // Прочие расчеты.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника);
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСБанкомЭквайрером") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам); // Эквайринг
	КонецЕсли;
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ВзносНаличными);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета);
	
	Возврат СписокОпераций;
	
КонецФункции

Функция ПолучитьСписокВидовОперацийПоступленияДСКасса() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ОтПокупателя);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.Прочее);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ОтПоставщика);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ПолучениеНаличныхВБанке);
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.РасчетыПоКредитам); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ВозвратЗаймаСотрудником); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ВозвратКредитаКонтрагентом); // Прочие расчеты.
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ПокупкаВалюты);
	КонецЕсли;
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты); // Прочие расчеты.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.ОтПодотчетника);
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.РозничнаяВыручка);
		СписокОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеВКассу.РозничнаяВыручкаСуммовойУчет);
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

#КонецОбласти

#Область РасходДС

Функция ПолучитьСписокВидовОперацийРасходДСБанк() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Поставщику);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.НаРасходы);
	
	// Зарплата по ведомости
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить() Тогда
		//СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Зарплата, "Зарплата по ведомости");
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Зарплата, НСтр("ka='ხელფასი უწყისის მიხედვით';ru='Зарплата по ведомости';en='Salary of statements'")); // Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаВРазрезеСотрудников, НСтр("ka='ხელფასი თანამშრმლის ჭრილში უწყისის მიხედვით';ru='Зарплата по ведомости в разрезе сотрудников';en='The salary of employees in the context of statements'")); // Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников
	КонецЕсли;
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ПрочиеРасчеты); // Прочие расчеты.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Покупателю);
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ВыдачаКредитаКонтрагенту); // Прочие расчеты
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику); // Прочие расчеты.
	КонецЕсли;
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Прочее); // Прочее.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику); // Подотчетнику.
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСБанкомЭквайрером") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты); // Эквайринг
	КонецЕсли;
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Налоги); // Налоги.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ПенсионномуФонду, НСТР("ka='საპენსიო ფონდში';ru='Пенсионному фонду';en='pension Fund'")); // Паганини ПФ
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.СнятиеНаличных);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет);
	
	Возврат СписокОпераций;
	
КонецФункции

Функция ПолучитьСписокВидовОперацийРасходДСКасса() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.Поставщику, "Поставщику");
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.НаРасходы, "На расходы");
	// Зарплата по ведомости
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить() Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.Зарплата, "Зарплата по ведомости");
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику, "Зарплата сотруднику");
	КонецЕсли;
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.ПрочиеРасчеты, "Прочему контрагенту (учредителю)"); // Прочие расчеты.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.Покупателю, "Покупателю (возврат)");
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам, "Возврат кредита"); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику); // Прочие расчеты.
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.ВыдачаКредитаКонтрагенту); // Прочие расчеты.
	КонецЕсли;
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.Прочее, "Прочий расход"); // Прочее.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.Подотчетнику); // Подотчетнику.
	Если Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить() Тогда
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ); // Эквайринг
	КонецЕсли;
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.Налоги, "Налоги"); // Налоги.
	СписокОпераций.Добавить(Перечисления.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк, "Наличные в банк"); // Наличные в банк.
	
	Возврат СписокОпераций;
	
КонецФункции

#КонецОбласти

#Область ХозяйственныеОперацииПоступленияИСписания

Функция ПолучитьСписокХозОперацийПоступленияДС() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ОтПокупателя, НСтр("ka='მყიდველისგან';ru='От покупателя';en=''"));
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Прочее, НСтр("ka='სხვა შემოსვლა';ru='Прочее поступление';en=''")); // Прочее.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ОтПоставщика, НСтр("ka='მომწოდებლისგან (დაბრუნება)';ru='От поставщика (возврат)';en=''"));
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РасчетыПоКредитам, НСтр("ka='კრედიტის მიღება';ru='Расчеты по кредитам';en=''")); // Прочие расчеты.
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратЗаймаСотрудником, НСтр("ka='თანამშრომლის მიერ სესხის დაფარვა';ru='Возврат займа сотрудником';en=''")); // Прочие расчеты.
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПокупкаВалюты, НСтр("ka='ვალუტის ყიდვა';ru='Покупка валюты';en=''"));
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПрочиеРасчеты, НСтр("ka='სხვა ხარჯები';ru='Прочие расчеты';en=''")); // Прочие расчеты.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ОтПодотчетника, НСтр("ka='საქვეანგარიშო პირისგან';ru='От подотчетника';en=''"));
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСБанкомЭквайрером") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПоступлениеОплатыПоКартам, НСтр("ka='ექვაირერის ანგარიშგება';ru='Эквайринг';en=''")); // Эквайринг
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Налоги, НСтр("ka='გადასახადები';ru='Налоги';en=''"));
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РозничнаяВыручка, НСтр("ka='საცალო გაყიდვიდან მიღებული შემოსავალი';ru='Розничная выручка';en=''"));
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РозничнаяВыручкаСуммовойУчет, НСтр("ka='საცალო გაყიდვიდან მიღებული შემოსავალი (თანხობრივი აღრიცხვა)';ru='Розничная вырчка (суммовой учет)';en=''"));
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

Функция ПолучитьСписокХОзОперацийРасходДС() Экспорт
	
	СписокОпераций = Новый СписокЗначений();
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Поставщику,НСтр("ka='მომწოდებელს';ru='Поставщику';en=''") );
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.НаРасходы,НСтр("ka='დასახარჯად';ru='На расходы';en=''") );
	
	// Зарплата по ведомости
	Если Константы.ФункциональнаяОпцияИспользоватьПодсистемуЗарплата.Получить() Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Зарплата,НСтр("ka='ხელფასი უწყისის მიხედვით';ru='Зарплата по ведомости';en=''") );
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ЗарплатаСотруднику,НСтр("ka='ხელფასი';ru='Зарплата сотруднику';en=''") );
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПрочиеРасчеты, НСтр("ka='სხვა კონტრაგენტს (დამფუძნებელს)';ru='Прочие расчеты';en=''") ); // Прочие расчеты.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Покупателю, НСтр("ka='მყიდველს (დაბრუნება)';ru='Покупателю (возврат)';en=''"));
	
	Если ПолучитьФункциональнуюОпцию("КредитыИЗаймы") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.РасчетыПоКредитам, НСтр("ka='კრედიტის დაბრუნება';ru='Расчеты по кредитам';en=''")); // Прочие расчеты.
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ВыдачаЗаймаСотруднику, НСтр("ka='თანამშრომლისთვის სესხის გაცემა';ru='Выдача займа сотруднику';en=''")); // Прочие расчеты.
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Прочее, НСтр("ka='სხვა ხარჯები';ru='Прочий расход';en=''")); // Прочее.
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Подотчетнику, НСтр("ka='ანგარიშვალდებულ პირს';ru='Подотчетнику';en=''")); // Подотчетнику.
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРасчетовСБанкомЭквайрером") Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ВозвратОплатыНаПлатежныеКарты, НСтр("ka='ექვაირერის ანგარიშგება';ru='Отчет эквайрера';en=''")); // Эквайринг
	КонецЕсли;
	
	СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.Налоги, НСтр("ka='გადასახადები';ru='Налоги';en=''")); // Налоги.
	
	Если Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Получить() Тогда
		СписокОпераций.Добавить(Справочники.ХозяйственныеОперации.ПеремещениеВКассуККМ, НСтр("ka='ანგარიშიდან სალაროში';ru='Перемещение в кассу ККМ';en=''"));
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

Функция ПолучитьСписокХОзОперацийПеремещениеДС() Экспорт
	
	СписокОпераций = Новый СписокЗначений();

	СписокОпераций.Добавить(Перечисления.ВидыОперацийПеремещенияДС.КассаБанк);
    СписокОпераций.Добавить(Перечисления.ВидыОперацийПеремещенияДС.БанкКасса);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПеремещенияДС.БанкБанк);
	СписокОпераций.Добавить(Перечисления.ВидыОперацийПеремещенияДС.КассаКасса);

	Возврат СписокОпераций;
	
КонецФункции


Функция ПолучитьЧистуюТаблицуИтоговДляЖурналаДокументов() Экспорт

	ТаблицаИтогов = Новый ТаблицаЗначений;
	ТаблицаИтогов.Колонки.Добавить("Показатель");
	ТаблицаИтогов.Колонки.Добавить("Значение");
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель =  НСтр("ka='დღის დასაწყისი';ru='Начало дня';en='Beginning of the day'");
	СтрокаИтогов.Значение = 0;
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель =  НСтр("ka='შემოსავალი';ru='Поступило';en='coming'");
	СтрокаИтогов.Значение = 0;
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель =  НСтр("ka='გასავალი';ru='Списано';en='consumption'");
	СтрокаИтогов.Значение = 0;
	
	// Начальный остаток
	СтрокаИтогов = ТаблицаИтогов.Добавить();
	СтрокаИтогов.Показатель =  НСтр("ka='დღის დასასრული';ru='Конец дня';en='End of the day'");
	СтрокаИтогов.Значение = 0;
	
	Возврат ТаблицаИтогов;
	
КонецФункции	

#КонецОбласти
